{
  "messages": [],
  "comments": [
    {
      "name": "Hamman Muraya",
      "content": "I hope you love this portfolio",
      "createdAt": "2026-02-17T07:39:04.370Z",
      "reactions": {
        "likes": 9
      },
      "replies": [
        {
          "id": 1771313960174,
          "name": "Hamman Muraya",
          "content": "I love it",
          "createdAt": "2026-02-17T07:39:20.174Z"
        }
      ],
      "id": 1
    },
    {
      "name": "Vin",
      "content": "On point",
      "emoji": "🎯",
      "createdAt": "2026-02-17T08:16:03.461Z",
      "reactions": {
        "likes": 3
      },
      "replies": [],
      "type": "professional",
      "id": 2
    }
  ],
  "projects": [
    {
      "id": 1,
      "title": "Portfolio Website",
      "type": "Web Development",
      "description": "A professional personal portfolio website showcasing work and achievements as a Senior Software Engineer & AI Specialist. Built with modern technologies including React, Vite, and Tailwind CSS, featuring smooth animations with Framer Motion, responsive design for all devices, and a stunning animated pyramid visualization.",
      "tags": ["React", "Vite", "Tailwind CSS", "Framer Motion"],
      "year": "2024",
      "category": "Web Development",
      "link": "https://hamanmuraya1.netlify.app/",
      "image": "https://images.pexels.com/photos/1181271/pexels-photo-1181271.jpeg"
    },
    {
      "id": 2,
      "title": "Ufugaji-BioID: Livestock Muzzle Print Biometrics",
      "type": "AI/Computer Vision",
      "description": "KSEF 2026 award-winning system using AI-powered muzzle print biometrics to combat cattle rustling in Kenya's ASAL regions. Features AI validation using Local Binary Patterns (LBP), CNN-inspired feature vector extraction, and cosine similarity matching. Built with React 19, Vite, and offline-first architecture.",
      "tags": ["React", "AI", "Computer Vision", "Image Processing", "Biometrics", "Offline-First"],
      "year": "2026",
      "category": "AI/ML",
      "link": "https://aistudio.google.com/apps/drive/10VRTax38bkRyaSyx5KoamV0c-uMy17vo?fullscreenApplet=true&showPreview=true&showAssistant=true",
      "image": "https://images.pexels.com/photos/591/animal-countryside-agriculture-farm.jpg"
    },
    {
      "id": 3,
      "title": "Brian & Jones Automotive",
      "type": "Full-Stack Application",
      "description": "A comprehensive automotive service website featuring a complete customer and admin experience. Customer features include a 3-step service booking wizard, vehicle inventory browsing with filters, customer dashboard for viewing appointment history and service records, and secure user authentication.",
      "tags": ["React", "CSS Modules", "React Router", "REST API"],
      "year": "2024",
      "category": "Full-Stack Development",
      "link": "https://brianjones.netlify.app/",
      "image": "https://images.pexels.com/photos/4480448/pexels-photo-4480448.jpeg"
    },
    {
      "id": 4,
      "title": "Ajali - Emergency Incident Reporting",
      "type": "Full-Stack Application",
      "description": "A localized platform designed to facilitate swift reporting and response to accidents and emergencies in Kenya. The system allows citizens to report incidents with geolocation data, images, and videos while ensuring the right authorities and public are informed in real-time.",
      "tags": ["React", "Redux Toolkit", "Flask", "Python", "SQLite", "Google Maps API"],
      "year": "2023",
      "category": "Full-Stack Development",
      "link": null,
      "image": "https://images.pexels.com/photos/12002262/pexels-photo-12002262.jpeg"
    },
    {
      "id": 5,
      "title": "Sustainable Maasai Legacy",
      "type": "E-commerce Platform",
      "description": "A custom marketplace platform connecting Maasai artisans to global markets, empowering local communities through e-commerce. The platform features secure payment processing integration, comprehensive inventory management, product catalog with search and filtering, user authentication and profiles, order tracking, and international shipping support.",
      "tags": ["E-commerce", "Payments", "Inventory Management", "Global Markets"],
      "year": "2022",
      "category": "E-commerce",
      "link": null,
      "image": "https://images.pexels.com/photos/13033124/pexels-photo-13033124.jpeg"
    }
  ],
  "testimonials": [
    {
      "id": 1,
      "name": "Amina Diallo",
      "role": "Software Engineering Lead",
      "content": "Hamman's expertise in AI and full-stack development transformed our product. His ability to implement complex RLHF systems is remarkable.",
      "rating": 5
    },
    {
      "id": 2,
      "name": "Kofi Asante",
      "role": "AI Startup Founder",
      "content": "The LLM training platform Hamman developed for our startup exceeded our expectations. Professional, efficient, and innovative.",
      "rating": 5
    },
    {
      "id": 3,
      "name": "Fatima Okafor",
      "role": "Data Science Manager",
      "content": "Hamman's technical skills in machine learning are exceptional. He helped us build robust models with outstanding performance.",
      "rating": 5
    }
  ],
  "about": {
    "id": 1,
    "summary": "Senior Software Engineer and AI Training Specialist with a Ph.D. in Software Engineering and over 8 years of experience building scalable systems and training advanced AI models. Expert in Reinforcement Learning from Human Feedback (RLHF), Supervised Fine-Tuning (SFT), and Expert-Level Data Annotation for Large Language Models (LLMs). Proven track record in technical support, software development, and AI data training across diverse domains including Computer Science, Mathematics, and Responsible AI. Combines deep technical proficiency in Python, Elixir, and TypeScript with the linguistic precision required for high-quality data annotation, chain-of-thought reasoning, and model evaluation.",
    "competencies": [
      "Technical Leadership & Mentorship",
      "IT Systems Administration & Technical Support",
      "AI Model Evaluation & Data Analysis",
      "Process Automation & Cloud Computing",
      "Web & Software Development",
      "Cross-Functional Collaboration & Remote Work Proficiency"
    ]
  },
  "skills": [
    {
      "id": 1,
      "category": "AI & Data Training",
      "skills": [
        "RLHF",
        "SFT",
        "LLM Evaluation",
        "Code Hallucination Detection",
        "Prompt Engineering",
        "Ground Truth Creation",
        "Chain-of-Thought Reasoning",
        "Model Stumping",
        "Responsible AI Guidelines",
        "HLE Benchmarking"
      ]
    },
    {
      "id": 2,
      "category": "Languages & Frameworks",
      "skills": [
        "Python (Django, Flask, SQLAlchemy)",
        "JavaScript/TypeScript (React, Node, Redux)",
        "Elixir (Phoenix)",
        "SQL",
        "HTML5/CSS3",
        "Java",
        "LaTeX"
      ]
    },
    {
      "id": 3,
      "category": "DevOps & Infrastructure",
      "skills": [
        "AWS (EC2, S3)",
        "Docker",
        "Kubernetes",
        "PostgreSQL",
        "Redis",
        "Linux/Bash",
        "Google Cloud",
        "Azure",
        "CI/CD Pipelines"
      ]
    },
    {
      "id": 4,
      "category": "Tools & Platforms",
      "skills": [
        "Snorkel AI Expert Platform",
        "FT Studio (Telus)",
        "Anthropic Interface",
        "Appen",
        "TELUS International",
        "OpenAI",
        "Hugging Face",
        "Jira",
        "Slack"
      ]
    }
  ],
  "workHistory": [
    {
      "id": 1,
      "company": "Snorkel AI",
      "location": "Remote",
      "role": "Expert Contributor (Gauss HLE Project)",
      "period": "Oct 2025 – Feb 2026",
      "responsibilities": [
        "Created expert-level question-answer pairs for the Humanity's Last Exam (HLE) benchmark in Computer Science and Engineering domains.",
        "Developed complex, multi-step reasoning problems that test AI models on deep understanding and precise thinking at a graduate level or higher.",
        "Provided detailed solutions and explanations adhering to strict formatting rules (LaTeX, Markdown) and domain-specific standards.",
        "Participated in peer review processes to ensure submission quality and adherence to project guidelines, defending submissions during adjudication when necessary.",
        "Ensured all content was original, non-routine, and self-contained without reliance on external tools or public archives."
      ]
    },
    {
      "id": 2,
      "company": "Alignerr",
      "location": "Remote",
      "role": "AI Trainer & Model Evaluator (Code Human Preference & Sigma Projects)",
      "period": "Aug 2025 – Feb 2026",
      "responsibilities": [
        "Code Human Preference: Selected git repositories and iterated with AI models to produce production-ready code. Conducted rigorous technical reviews of AI-generated code snippets in Python and TypeScript, identifying logic errors and security vulnerabilities.",
        "Sigma Math Project: Created unique, original, and complex mathematical reasoning questions designed to stump AI models across subdomains like Graph Theory, Number Theory, and Calculus.",
        "Wrote detailed Chain-of-Thought explanations demonstrating step-by-step logical processes for complex problems, ensuring accuracy and factual correctness.",
        "Evaluated model responses against quality rubrics focusing on logic, correctness, naming, modularity, and error handling.",
        "Ensured all mathematical expressions were formatted correctly using LaTeX within Markdown editors."
      ]
    },
    {
      "id": 3,
      "company": "Telus International",
      "location": "Remote",
      "role": "Senior AI Trainer & Responsible AI Maker (Armadillo & Knowledge Projects)",
      "period": "Jun 2025 – Jan 2026",
      "responsibilities": [
        "Project Armadillo: Graded and rewrote AI responses for affective conversations, ensuring adherence to responsible AI requirements (deflection, disclaimers, limited engagement).",
        "Evaluated AI outputs on engagement, emotional support, and overall quality using a 1-5 scale within FT Studio.",
        "Knowledge Project: Contributed expert-level submissions in Computer Science and Mathematics domains, adhering to strict rate schedules and billing cycles.",
        "Data Annotation: Conducted AI data labeling, model evaluation, and prompt optimization for conversational AI models.",
        "Improved model performance by 20% through QA checks, metadata structuring, and supervised learning pipeline support.",
        "Ensured compliance with data privacy, AI ethics standards, and specific project guidelines regarding mental health and crisis deflection."
      ]
    },
    {
      "id": 4,
      "company": "Telus Digital",
      "location": "Remote, USA",
      "role": "Senior AI Trainer & Software Engineer",
      "period": "Jul 2023 – May 2025",
      "responsibilities": [
        "Lead Code Evaluator: Conducted rigorous technical reviews of AI-generated code snippets in Python and TypeScript, identifying logic errors, security vulnerabilities, and inefficiencies.",
        "RLHF Strategy: Ranked model responses and authored \"Gold Standard\" rewrites to train models on best practices, code readability, and modular design.",
        "Model Optimization: Designed complex, adversarial prompts to test model reasoning capabilities in edge cases (e.g., race conditions, memory leaks).",
        "Technical Documentation: Provided detailed, pedagogical rationales for every evaluation, teaching the model why specific solutions were superior."
      ]
    },
    {
      "id": 5,
      "company": "Standard Chartered Bank",
      "location": "UK (Remote)",
      "role": "Senior Backend Engineer (Contract)",
      "period": "Dec 2022 – Jun 2023",
      "responsibilities": [
        "Built secure, high-performance backend services for a global banking platform using Elixir and Python.",
        "Designed versioned, backwards-compatible APIs consumed by millions of users, focusing on data consistency and latency reduction.",
        "Implemented advanced logging and monitoring to diagnose system bottlenecks in a distributed architecture."
      ]
    },
    {
      "id": 6,
      "company": "Power Financial Wellness",
      "location": "Nairobi, Kenya",
      "role": "Senior Backend Engineer (FinTech)",
      "period": "Jul 2021 – Nov 2022",
      "responsibilities": [
        "Led the backend engineering for a high-traffic fintech platform serving thousands of users across East Africa.",
        "Built secure integrations with third-party payment gateways and mobile money providers.",
        "Translated complex financial product requirements into reliable, bug-free code, aligning technical decisions with business goals."
      ]
    },
    {
      "id": 7,
      "company": "Alsoug.com",
      "location": "Khartoum, Sudan",
      "role": "Senior Backend Engineer",
      "period": "Apr 2020 – Jun 2021",
      "responsibilities": [
        "Led the migration from a monolithic legacy system to a modern service-oriented architecture, improving system uptime.",
        "Established automated testing pipelines to ensure code quality during rapid release cycles."
      ]
    },
    {
      "id": 8,
      "company": "Gladys Technologies",
      "location": "Nairobi, Kenya",
      "role": "Software Engineer",
      "period": "Apr 2017 – Mar 2020",
      "responsibilities": [
        "Developed core REST and GraphQL APIs using Elixir and Phoenix that formed the backbone of multiple client applications.",
        "Implemented robust authentication (OAuth/JWT) systems for client applications."
      ]
    }
  ],
  "education": [
    {
      "id": 1,
      "degree": "PhD in Software Engineering",
      "institution": "California State University",
      "location": "USA",
      "period": "2019 – 2022",
      "focus": "Scalable Software Architectures, Distributed Systems, and Performance Modeling"
    },
    {
      "id": 2,
      "degree": "MSc in Software Engineering",
      "institution": "Lincoln University",
      "location": "UK",
      "period": "2015 – 2017",
      "focus": "Merit"
    },
    {
      "id": 3,
      "degree": "BSc in Applied Computer Science",
      "institution": "University of Nairobi",
      "location": "Kenya",
      "period": "2010 – 2014",
      "focus": "Second Class Honours (Upper Division)"
    },
    {
      "id": 4,
      "degree": "Software Engineering Bootcamp (Full-Stack)",
      "institution": "Moringa School",
      "location": "Kenya",
      "period": "2022",
      "focus": "1,000+ hours of coding practice in Python, Flask/Django, and React.js"
    }
  ]
}
